#+bibliography: ./data/translations/raw_data.bib

** Alignment models
The repository used IBM Model 2 inplemented in [[https://www.nltk.org/][NLTK]] to align bitexts
from source texts to target texts and from target texts to source
texts. The accuracy information was calculated with [[https://github.com/nehcx/kokinMisalign/blob/master/src/accuracy.py][accuracy.py]] as
the following table (intersection means alignment that was inferred by
both of the two direction).

#+BEGIN_SRC sh :results raw
  make accuracy
#+END_SRC

#+RESULTS[7f435add1cc23d88ce3b2ff1057c2e4e1ddaabf0]:
#+begin_example
cd src; python accuracy.py; column -s, -t ../artifacts/accuracy.csv
model      source → target  target → source  bidirection
precision  55.41            38.25            69.85
recall     61.68            72.54            56.43
AER        41.97            52.78            37.01
#+end_example

The calculation was based on the matching ratio of the wlsp codes of
aligned word pairs. Compared to manual evaluation, this calculation
count many correct cases as wrong, which may cause the accuracy to be
reletively low. The results is in the case of =iteration==8= in IBM
model 2.

